---
kind: property
id: P:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.ColorMode
source: html/6456ee51-7298-4408-9d0f-2947c3c3c1a3.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.ColorMode Property

The current color mode for the PointCloudInstance element or its scan.

## Syntax (C#)
```csharp
public PointCloudColorMode ColorMode { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration